8_plotting/README.md


# Base R Plotting

This repo contains problem and solution notebooks for plotting with
base R functions. 

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">FILE <code>.ipynb</code></th>
<th scope="col" class="org-left">DESCRIPTION</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>plotting</code></td>
<td class="org-left">Base R plotting with <code>plot()</code></td>
</tr>


<tr>
<td class="org-left"><code>adding_details</code></td>
<td class="org-left">Adding details to an existing plot<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>


<tr>
<td class="org-left"><code>different_plots</code></td>
<td class="org-left">Different base R plot types<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></td>
</tr>
</tbody>
</table>

You find a summary of functions with examples in the file
`cheatsheet.pdf` (Gerard, 2017). Paradoxically, the author
reproduced `ggplot2` plots using base R, which is the wrong way
around, because `ggplot2` is a fairly recent addition to R
(ca. 2016). But it is superbly successful for pretty plotting.

In my view, solid knowledge of base R methods beats broad knowledge
of arcane packages especially for interactive, exploratory EDA. When
you're presenting, many other options exist - but exploration is key
because it's content, not form.


# References

Gerard, D (August 8, 2017). Base R Graphics Cheat Sheet [repo]. [URL:
dcgerard.github.io](https://dcgerard.github.io/stat234/base_r_cheatsheet.html).


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> Based on Davies' treatment in Book of R (2016).

<sup><a id="fn.2" href="#fnr.2">2</a></sup> Compare with the DataCamp course "Data Visualization with R" by
Ron Pearson (2017) for some details.
